{
  "header": {
    "home": "Início",
    "about": "Sobre",
    "contact": "Contato",
    "connectSpotify": "Conectar Spotify",
    "buyMeCoffee": "Buy me a coffee",
    "support": "Nos Apoie",
    "privacyPolicy": "Política de Privacidade",
    "termsOfUse": "Termos de uso",
    "openMenu": "Abrir menu"
  },
  "home": {
    "welcomeTitle": "Bem-vindo ao",
    "description": "Seu top de álbuns, agora em forma de arte! Crie uma colagem com os mais ouvidos do seu perfil no Last.fm.",
    "startButton": "Começar",
    "integrationTitle": "Ainda não conectou seu Spotify ao Last.fm?",
    "integrationDescription": "Para que suas músicas do Spotify sejam registradas e apareçam na colagem, é necessário conectar sua conta ao Last.fm.",
    "integrationButton": "Aprender como conectar",
    "examplesTitle": "Exemplos de Colagens",
    "collage3x3Title": "Colagem 3x3",
    "collage3x3Description": "Uma grade compacta com os 9 álbuns mais ouvidos. Ideal para destacar seus favoritos do last.fm da semana.",
    "collage4x4Title": "Colagem 4x4",
    "collage4x4Description": "Um equilíbrio entre variedade e tamanho. Perfeita para o seu top álbum do mês do last.fm.",
    "collage5x5Title": "Colagem 5x5",
    "collage5x5Description": "Para os ouvintes mais intensos! Mostre 25 álbuns do su last.fm em uma única imagem, ideal para todo o seu histórico."
  },
  "metadata": {
    "title": "ScrobbleWall – Sua música em forma de arte",
    "description": "Transforme seus álbuns mais ouvidos do Last.fm em colagens visuais personalizadas. Compartilhe sua paixão musical com o mundo!",
    "ogTitle": "ScrobbleWall – Sua música em forma de arte",
    "ogDescription": "Crie colagens com seus álbuns mais ouvidos no Last.fm e compartilhe sua identidade musical.",
    "twitterTitle": "ScrobbleWall – Sua música em forma de arte"
  },
  "about": {
    "title": "Sobre o ScrobbleWall",
    "paragraph1": "O ScrobbleWall é um projeto criado para transformar seus dados musicais do Last.fm em arte visual. A ideia é simples: você fornece seu nome de usuário do Last.fm, e o site gera uma colagem com os álbuns mais reproduzidos no período escolhido.",
    "paragraph2": "Com uma interface simples e personalizável, é possível criar facilmente uma imagem com os álbuns que marcaram sua semana, mês ou até mesmo toda sua jornada musical. Você pode incluir informações como o nome do álbum e artista, ajustar o tamanho da grade e fazer o download da imagem gerada com alta qualidade.",
    "paragraph3": "Tudo é feito diretamente no navegador, sem necessidade de login ou coleta de dados sensíveis.",
    "whyCreatedTitle": "Por que criei este site?",
    "whyCreatedText1": "Sou Carlos Siqueira, desenvolvedor front-end com paixão por música, arte e dados. Sempre achei fascinante como nossa trilha sonora pessoal pode contar histórias. O ScrobbleWall nasceu como uma forma de dar vida visual a esses dados e compartilhar nossa identidade musical com o mundo.",
    "whyCreatedText2": "Se você gostou do projeto, considere apoiar com um café ou compartilhá-lo com amigos!",
    "thanks": "Obrigado por visitar o site. 🎵✨"
  },
  "contact": {
    "title": "Contato",
    "description": "Tem dúvidas, sugestões ou precisa de ajuda? Fique à vontade para nos enviar uma mensagem.",
    "emailLabel": "Endereço de e-mail",
    "messageLabel": "Mensagem",
    "sendButton": "Enviar",
    "sendingButton": "Enviando...",
    "successMessage": "Mensagem enviada com sucesso!",
    "orSendTo": "Ou envie diretamente para:"
  },
  "connect": {
    "title": "Como conectar o Spotify ao Last.fm",
    "intro1": "O Last.fm é uma plataforma que permite integrar serviços de streaming, como o Spotify, para registrar automaticamente as músicas que você ouve. Esse processo é conhecido como 'scrobbling' e ajuda a catalogar seus hábitos musicais.",
    "intro2": "Funciona como uma comunidade virtual focada em interesses musicais. Você pode trocar informações e indicações com fãs da sua banda preferida, por exemplo, e ver sua compatibilidade musical com outros usuários.",
    "stepsTitle": "Passo a passo para conectar",
    "step1": "Acesse o site do Last.fm e faça login na sua conta (ou crie uma nova).",
    "step2": "No rodapé da página, dentro de 'Help' selecione Track My Music, ou acesse diretamente a página de aplicativos conectados. Você também pode clicar em Download Scrobbler dentro de 'Goodies'",
    "step3": "Clique em 'Spotify', em seguida clique em 'Connect'.",
    "step4": "Uma janela pop-up do Spotify será aberta solicitando permissão para integrar as plataformas. Clique em 'Aceitar'.",
    "step5": "Após a confirmação, suas músicas tocadas no Spotify começarão a ser registradas automaticamente no seu perfil do Last.fm.",
    "afterTitle": "O que acontece depois?",
    "afterText": "Com o scrobbling ativo, todas as faixas reproduzidas no Spotify serão registradas no seu perfil do Last.fm, independentemente do dispositivo utilizado (celular, tablet ou computador). Você poderá visualizar estatísticas detalhadas sobre suas músicas, álbuns e artistas mais ouvidos, além de descobrir sua compatibilidade musical com outros usuários.",
    "removeTitle": "Como remover a conexão?",
    "removeText": "Caso deseje desconectar o Spotify do Last.fm, acesse a página de aplicativos conectados do Spotify, localize o Last.fm e clique em 'Remover Acesso'.",
    "conclusion": "Pronto! Agora você já sabe como integrar o Spotify ao Last.fm e aproveitar ao máximo os recursos do ScrobbleWall."
  },
  "generate": {
    "username": "Nome de usuário do Last.fm",
    "period": "Período",
    "gridSize": "Tamanho da grade",
    "includeInfo": "Incluir informações do álbum",
    "includePlayCount": "Incluir contagem de reproduções",
    "generateButton": "Gerar Colagem",
    "loading": "Carregando...",
    "downloadButton": "Baixar Imagem",
    "backButton": "Voltar",
    "errorNetwork": "Erro de rede. Verifique sua conexão.",
    "errorData": "Erro ao buscar dados. Verifique o nome de usuário ou tente novamente mais tarde.",
    "period7day": "Última semana",
    "period1month": "Último mês",
    "period3month": "Últimos 3 meses",
    "period6month": "Últimos 6 meses",
    "period12month": "Último ano",
    "periodOverall": "Todo o período"
  },
  "footer": {
    "termsOfUse": "Termos de uso",
    "privacyPolicy": "Política de Privacidade",
    "rightsReserved": "Todos os direitos reservados.",
    "developedBy": "Desenvolvido por"
  }
}
